DataProcessors/ЛБ_НастройкаРеквизитовДокументовЗалогодателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_НастройкаРеквизитовДокументовЗалогодателя</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_РеквизитыДокументовЗалогодателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязателен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСимволов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоЦифры</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокументаЗалогодателя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидГражданства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ВидыГражданства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛБ_ПереченьДокументовЗалогодателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПереченьДокументовЗалогодателя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидГражданства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыГражданства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТребуетсяДополнительныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаРеквизитовДокументовЗалогодателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаРеквизитовДокументовЗалогодателя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Видимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСимволов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоЦифры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидГражданства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыГражданства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_РеквизитыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЛБ_НастройкаРеквизитовДокументовЗалогодателя/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицуДокументов();
	ЗаполнитьСписокВыбораДокументов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораДокументов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_ПереченьДокументовЗалогодателя.ВидДокумента КАК ВидДокумента,
		|	ЛБ_ПереченьДокументовЗалогодателя.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя
        // ++ Сербаев 02.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
		|	,
		|	ЛБ_ПереченьДокументовЗалогодателя.ВидГражданства КАК ВидГражданства
        // -- Сербаев 02.06.2023
		|ИЗ
		|	РегистрСведений.ЛБ_ПереченьДокументовЗалогодателя КАК ЛБ_ПереченьДокументовЗалогодателя";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	УдСтроки = Новый СписокЗначений;
	Для каждого Стр Из ТаблицаЗапроса Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ВидДокумента",             Стр.ВидДокумента);
		Отбор.Вставить("ВидДокументаЗалогодателя", Стр.ВидДокументаЗалогодателя);
		// ++ Сербаев 02.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
		Отбор.Вставить("ВидГражданства",           Стр.ВидГражданства);
        // -- Сербаев 02.06.2023
		
		Строки = Объект.ТаблицаДокументов.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			УдСтроки.Добавить(Стр);
		КонецЕсли;	
	КонецЦикла; 
	Для каждого Эл Из УдСтроки Цикл
		ТаблицаЗапроса.Удалить(Эл.Значение);
	КонецЦикла;	
	СписокВ = Новый СписокЗначений;
	Для каждого Стр Из ТаблицаЗапроса Цикл
		Если СписокВ.НайтиПоЗначению(Стр.ВидДокумента) = Неопределено Тогда
			СписокВ.Добавить(Стр.ВидДокумента);
		КонецЕсли;	
	КонецЦикла;	
	
	Элементы.ТаблицаДокументовВидДокумента.СписокВыбора.Очистить();
	Для каждого Эл Из СписокВ Цикл
		Элементы.ТаблицаДокументовВидДокумента.СписокВыбора.Добавить(Эл.Значение);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораДокументовЗалогодателя(ВидДокумента)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_ПереченьДокументовЗалогодателя.ВидДокумента КАК ВидДокумента,
		|	ЛБ_ПереченьДокументовЗалогодателя.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя
		// ++ Сербаев 02.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
		|	,
		|	ЛБ_ПереченьДокументовЗалогодателя.ВидГражданства КАК ВидГражданства
		// -- Сербаев 02.06.2023
		|ИЗ
		|	РегистрСведений.ЛБ_ПереченьДокументовЗалогодателя КАК ЛБ_ПереченьДокументовЗалогодателя
		|ГДЕ
		|	ЛБ_ПереченьДокументовЗалогодателя.ВидДокумента = &ВидДокумента";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	УдСтроки = Новый СписокЗначений;
	Для каждого Стр Из ТаблицаЗапроса Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ВидДокумента", Стр.ВидДокумента);
		Отбор.Вставить("ВидДокументаЗалогодателя", Стр.ВидДокументаЗалогодателя);
		// ++ Сербаев 02.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
		Отбор.Вставить("ВидГражданства", Стр.ВидГражданства);
        // -- Сербаев 02.06.2023
		
		Строки = Объект.ТаблицаДокументов.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			УдСтроки.Добавить(Стр);
		КонецЕсли;	
	КонецЦикла; 
	Для каждого Эл Из УдСтроки Цикл
		ТаблицаЗапроса.Удалить(Эл.Значение);
	КонецЦикла;	
	// ++ Сербаев 02.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
	//СписокВ = Новый СписокЗначений;
	//Для каждого Стр Из ТаблицаЗапроса Цикл
	//	Если СписокВ.НайтиПоЗначению(Стр.ВидДокументаЗалогодателя) = Неопределено Тогда
	//		СписокВ.Добавить(Стр.ВидДокументаЗалогодателя);
	//	КонецЕсли;	
	//КонецЦикла;
	МассивВ = Новый Массив;
	Для каждого Стр Из ТаблицаЗапроса Цикл
		СтруктураВ = Новый Структура("ВидДокументаЗалогодателя, ВидГражданства", Стр.ВидДокументаЗалогодателя, Стр.ВидГражданства);
		МассивВ.Добавить(СтруктураВ);
	КонецЦикла;
	Возврат МассивВ;
	// -- Сербаев 02.06.2023
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицу(КлючСтроки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_РеквизитыДокументовЗалогодателя.Ссылка КАК Реквизит
		|ИЗ
		|	Справочник.ЛБ_РеквизитыДокументовЗалогодателя КАК ЛБ_РеквизитыДокументовЗалогодателя
		|ГДЕ
		|	ЛБ_РеквизитыДокументовЗалогодателя.Предопределенный = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_РеквизитыДокументовЗалогодателя.Порядок";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	    НоваяСтр = Объект.ТаблицаРеквизиты.Добавить();
		НоваяСтр.Реквизит = Выборка.Реквизит;
		НоваяСтр.КлючСтроки = КлючСтроки;
	Конеццикла;   
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуДокументов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокумента КАК ВидДокумента,
		|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
		|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Реквизит КАК Реквизит,
		|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Обязателен КАК Обязателен,
		|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Видимость КАК Видимость,
		|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.КоличествоСимволов КАК КоличествоСимволов,
		|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ТолькоЦифры КАК ТолькоЦифры
		// ++ Сербаев 02.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
		|	,
		|	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидГражданства КАК ВидГражданства
        // -- Сербаев 02.06.2023
		|ИЗ
		|	РегистрСведений.ЛБ_НастройкаРеквизитовДокументовЗалогодателя КАК ЛБ_НастройкаРеквизитовДокументовЗалогодателя";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаВидов = ТаблицаЗапроса.Скопировать();
    // ++ Сербаев 02.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
	//ТаблицаВидов.Свернуть("ВидДокумента, ВидДокументаЗалогодателя");
	ТаблицаВидов.Свернуть("ВидДокумента, ВидДокументаЗалогодателя, ВидГражданства");
	// -- Сербаев 02.06.2023
	Объект.ТаблицаДокументов.Загрузить(ТаблицаВидов);
	Ном = 0;
	Для каждого СтрДок Из Объект.ТаблицаДокументов Цикл
		Ном = Ном + 1;
		СтрДок.КлючСтроки = Ном;
		
		ЗаполнитьТаблицу(СтрДок.КлючСтроки); 
		
		ОтборДок = Новый Структура;
		ОтборДок.Вставить("ВидДокумента",             СтрДок.ВидДокумента);
		ОтборДок.Вставить("ВидДокументаЗалогодателя", СтрДок.ВидДокументаЗалогодателя);
        // ++ Сербаев 02.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
		ОтборДок.Вставить("ВидГражданства",           СтрДок.ВидГражданства);
        // -- Сербаев 02.06.2023
		Строки = ТаблицаЗапроса.НайтиСтроки(ОтборДок);
		Для каждого Стр Из Строки Цикл
			Отбор = Новый структура;
			Отбор.Вставить("Реквизит", Стр.Реквизит);
			Отбор.Вставить("КлючСтроки", СтрДок.КлючСтроки);
			
			Строки = Объект.ТаблицаРеквизиты.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда
				СтрТаб = Строки.Получить(0);
				СтрТаб.Обязателен         = Стр.Обязателен;
				СтрТаб.Видимость          = Стр.Видимость;
				СтрТаб.КоличествоСимволов = Стр.КоличествоСимволов;
				СтрТаб.ТолькоЦифры        = Стр.ТолькоЦифры;
			КонецЕсли;	
		Конеццикла;	
    КонецЦикла
КонецПроцедуры	

&НаСервере
// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
//Процедура СохранитьНаСервере(Идентификатор, ВидДокумента, ВидДокументаЗалогодателя)
Процедура СохранитьНаСервере(Идентификатор, ВидДокумента, ВидДокументаЗалогодателя, ВидГражданства)
// -- Сербаев 05.06.2023
	Стр = Объект.ТаблицаРеквизиты.НайтиПоИдентификатору(Идентификатор);
	НаборЗаписей = РегистрыСведений.ЛБ_НастройкаРеквизитовДокументовЗалогодателя.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента); 
	НаборЗаписей.Отбор.ВидДокументаЗалогодателя.Установить(ВидДокументаЗалогодателя);
	// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
	НаборЗаписей.Отбор.ВидГражданства.Установить(ВидГражданства);
    // -- Сербаев 05.06.2023
	НаборЗаписей.Отбор.Реквизит.Установить(Стр.Реквизит);
	Запись = НаборЗаписей.Добавить();
	Запись.ВидДокумента             = ВидДокумента;
	Запись.ВидДокументаЗалогодателя = ВидДокументаЗалогодателя;
	// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
	Запись.ВидГражданства           = ВидГражданства;
    // -- Сербаев 05.06.2023
	Запись.Реквизит           = Стр.Реквизит;
	Запись.Обязателен         = Стр.Обязателен;
	Запись.Видимость          = Стр.Видимость;
	Запись.КоличествоСимволов = Стр.КоличествоСимволов;
	Запись.ТолькоЦифры        = Стр.ТолькоЦифры;
	
	НаборЗаписей.Записать(Истина);
КонецПроцедуры	

&НаСервере
// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
//Процедура СохранитьНаСервереПоКлючу(КлючСтроки, ВидДокумента, ВидДокументаЗалогодателя)
Процедура СохранитьНаСервереПоКлючу(КлючСтроки, ВидДокумента, ВидДокументаЗалогодателя, ВидГражданства)
    // -- Сербаев 05.06.2023
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	Строки = Объект.ТаблицаРеквизиты.НайтиСтроки(Отбор);
	Для каждого Стр Из Строки Цикл
		НаборЗаписей = РегистрыСведений.ЛБ_НастройкаРеквизитовДокументовЗалогодателя.СоздатьНаборЗаписей();
	    НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента); 
		НаборЗаписей.Отбор.ВидДокументаЗалогодателя.Установить(ВидДокументаЗалогодателя);
		// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
		НаборЗаписей.Отбор.ВидГражданства.Установить(ВидГражданства);
        // -- Сербаев 05.06.2023
		НаборЗаписей.Отбор.Реквизит.Установить(Стр.Реквизит);
		Запись = НаборЗаписей.Добавить();
		Запись.ВидДокумента             = ВидДокумента;
		Запись.ВидДокументаЗалогодателя = ВидДокументаЗалогодателя;
		// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
		Запись.ВидГражданства           = ВидГражданства;
        // -- Сербаев 05.06.2023
		Запись.Реквизит           = Стр.Реквизит;
		Запись.Обязателен         = Стр.Обязателен;
		Запись.Видимость          = Стр.Видимость;
		Запись.КоличествоСимволов = Стр.КоличествоСимволов;
		Запись.ТолькоЦифры        = Стр.ТолькоЦифры;  
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;	
КонецПроцедуры	  
	
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры 

&НаСервере
// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
//Процедура ОтметитьВсеНаСервере(КлючСтроки, ВидДокумента, ВидДокументаЗалогодателя)    
Процедура ОтметитьВсеНаСервере(КлючСтроки, ВидДокумента, ВидДокументаЗалогодателя, ВидГражданства)
// -- Сербаев 05.06.2023	
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	СтрокиРек = Объект.ТаблицаРеквизиты.НайтиСтроки(Отбор);
	Для каждого Стр Из СтрокиРек Цикл
		Стр.Видимость = Истина;
		Стр.Обязателен = Истина;
	Конеццикла;
	// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
	//СохранитьНаСервереПоКлючу(КлючСтроки, ВидДокумента, ВидДокументаЗалогодателя);
	СохранитьНаСервереПоКлючу(КлючСтроки, ВидДокумента, ВидДокументаЗалогодателя, ВидГражданства);
    // -- Сербаев 05.06.2023
КонецПроцедуры	

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	СтрокаТабличнойЧасти = Элементы.ТаблицаДокументов.ТекущиеДанные;
	// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
    //ОтметитьВсеНаСервере(СтрокаТабличнойЧасти.КлючСтроки, СтрокаТабличнойЧасти.ВидДокумента, СтрокаТабличнойЧасти.ВидДокументаЗалогодателя);
	ОтметитьВсеНаСервере(СтрокаТабличнойЧасти.КлючСтроки, СтрокаТабличнойЧасти.ВидДокумента, СтрокаТабличнойЧасти.ВидДокументаЗалогодателя, СтрокаТабличнойЧасти.ВидГражданства);
	// -- Сербаев 05.06.2023
КонецПроцедуры

&НаСервере
// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
//Процедура УдалитьОтметкуНаСервере(КлючСтроки, ВидДокумента, ВидДокументаЗалогодателя)    
Процедура УдалитьОтметкуНаСервере(КлючСтроки, ВидДокумента, ВидДокументаЗалогодателя, ВидГражданства)
// -- Сербаев 05.06.2023	
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	СтрокиРек = Объект.ТаблицаРеквизиты.НайтиСтроки(Отбор);
	Для каждого Стр Из СтрокиРек Цикл
		Стр.Видимость  = Ложь;
		Стр.Обязателен = Ложь;
	Конеццикла;
	// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
    //СохранитьНаСервереПоКлючу(КлючСтроки, ВидДокумента, ВидДокументаЗалогодателя);
    СохранитьНаСервереПоКлючу(КлючСтроки, ВидДокумента, ВидДокументаЗалогодателя, ВидГражданства);
	// -- Сербаев 05.06.2023
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьОтметку(Команда)
	СтрокаТабличнойЧасти = Элементы.ТаблицаДокументов.ТекущиеДанные;
	// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
    //УдалитьОтметкуНаСервере(СтрокаТабличнойЧасти.КлючСтроки, СтрокаТабличнойЧасти.ВидДокумента, СтрокаТабличнойЧасти.ВидДокументаЗалогодателя);
	УдалитьОтметкуНаСервере(СтрокаТабличнойЧасти.КлючСтроки, СтрокаТабличнойЧасти.ВидДокумента, 
	                        СтрокаТабличнойЧасти.ВидДокументаЗалогодателя, СтрокаТабличнойЧасти.ВидГражданства);
	// -- Сербаев 05.06.2023
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбязателенПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаРеквизиты.ТекущиеДанные;
	Если ТекСтрока.Обязателен Тогда
		ТекСтрока.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовПриАктивизацииСтроки(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТаблицаДокументов.ТекущиеДанные;	
		
	Если СтрокаТабличнойЧасти <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки);
		Элементы.ТаблицаРеквизиты.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);		
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", 0);
		Элементы.ТаблицаРеквизиты.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВидДокументаПриИзменении(Элемент)
	
	// ++ Сербаев 02.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
	//СтрокаТабличнойЧасти = Элементы.ТаблицаДокументов.ТекущиеДанные;
	//СписокВыбора = ПолучитьСписокВыбораДокументовЗалогодателя(СтрокаТабличнойЧасти.ВидДокумента);
	//Если СписокВыбора.Количество() > 1 Тогда
	//	ВыбЗначение = ЭтаФорма.ВыбратьИзСписка(СписокВыбора, );
	//	Если НЕ ВыбЗначение = неопределено Тогда
	//		СтрокаТабличнойЧасти.ВидДокументаЗалогодателя = ВыбЗначение.Значение;
	//	КонецЕсли;	
	//Иначе
	//	СтрокаТабличнойЧасти.ВидДокументаЗалогодателя = СписокВыбора.Получить(0).Значение;
	//КонецЕсли;	
	//СохранитьНаСервереПоКлючу(СтрокаТабличнойЧасти.КлючСтроки, СтрокаТабличнойЧасти.ВидДокумента, СтрокаТабличнойЧасти.ВидДокументаЗалогодателя);
	
	СтрокаТабличнойЧасти = Элементы.ТаблицаДокументов.ТекущиеДанные;
	СписокВыбора = ПолучитьСписокВыбораДокументовЗалогодателя(СтрокаТабличнойЧасти.ВидДокумента);
	Если СписокВыбора.Количество() > 1 Тогда
		
		НовСписок = Новый СписокЗначений;
		Для каждого Стр Из СписокВыбора Цикл
			Если НовСписок.НайтиПоЗначению(Стр.ВидДокументаЗалогодателя) = Неопределено Тогда
				НовСписок.Добавить(Стр.ВидДокументаЗалогодателя);
			КонецЕсли;
		КонецЦикла;
		
		Если НовСписок.Количество() > 1 Тогда
			
			ВыбЗначение = ЭтаФорма.ВыбратьИзСписка(НовСписок);
			Если НЕ ВыбЗначение = Неопределено Тогда
				СтрокаТабличнойЧасти.ВидДокументаЗалогодателя = ВыбЗначение.Значение;
				
				СписокВыбораВидаГражданства = Новый СписокЗначений;
				Для каждого Стр1 Из СписокВыбора Цикл
					Если ВыбЗначение.Значение = Стр1.ВидДокументаЗалогодателя Тогда
						СписокВыбораВидаГражданства.Добавить(Стр1.ВидГражданства);
					КонецЕсли;
				КонецЦикла;
				
				Если СписокВыбораВидаГражданства.Количество() > 1 Тогда
					
					ВидГражданстваЗначение = ЭтаФорма.ВыбратьИзСписка(СписокВыбораВидаГражданства);
					Если НЕ ВидГражданстваЗначение = Неопределено Тогда
						СтрокаТабличнойЧасти.ВидГражданства = ВидГражданстваЗначение.Значение;
					КонецЕсли; 
					
				ИначеЕсли СписокВыбораВидаГражданства.Количество() = 1 Тогда	
					СтрокаТабличнойЧасти.ВидГражданства = СписокВыбораВидаГражданства.Получить(0).Значение;
				КонецЕсли;
				
			КонецЕсли; 
			
		ИначеЕсли НовСписок.Количество() = 1 Тогда
			СтрокаТабличнойЧасти.ВидДокументаЗалогодателя = НовСписок.Получить(0).Значение; 
			
			СписокВыбораВидаГражданства = Новый СписокЗначений;
			Для каждого Стр2 Из СписокВыбора Цикл
				Если СтрокаТабличнойЧасти.ВидДокументаЗалогодателя = Стр2.ВидДокументаЗалогодателя Тогда
					СписокВыбораВидаГражданства.Добавить(Стр2.ВидГражданства);
				КонецЕсли; 
			КонецЦикла; 
			
			Если СписокВыбораВидаГражданства.Количество() > 1 Тогда
				
				ВидГражданстваЗначение = ЭтаФорма.ВыбратьИзСписка(СписокВыбораВидаГражданства);
				Если НЕ ВидГражданстваЗначение = Неопределено Тогда
					СтрокаТабличнойЧасти.ВидГражданства = ВидГражданстваЗначение.Значение;
				КонецЕсли; 
				
			ИначеЕсли СписокВыбораВидаГражданства.Количество() = 1 Тогда	
				СтрокаТабличнойЧасти.ВидГражданства = СписокВыбораВидаГражданства.Получить(0).Значение;
			КонецЕсли;
			
		КонецЕсли; 
		
	ИначеЕсли СписокВыбора.Количество() = 1 Тогда
		СтрокаТабличнойЧасти.ВидДокументаЗалогодателя = СписокВыбора[0].ВидДокументаЗалогодателя;
		СтрокаТабличнойЧасти.ВидГражданства           = СписокВыбора[0].ВидГражданства;
	Иначе
		Сообщить("Доработать ошибку!");
	КонецЕсли;	
	СохранитьНаСервереПоКлючу(СтрокаТабличнойЧасти.КлючСтроки, СтрокаТабличнойЧасти.ВидДокумента, 
	СтрокаТабличнойЧасти.ВидДокументаЗалогодателя, СтрокаТабличнойЧасти.ВидГражданства);
	// -- Сербаев 02.06.2023
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючСтроки() Экспорт
	
	ТаблицаКлючей = Объект.ТаблицаДокументов.Выгрузить(, "КлючСтроки");
	Если  ТаблицаКлючей.Количество() = 1 Тогда
		Возврат 1;
	Иначе	
		ТаблицаКлючей.Сортировать("КлючСтроки Убыв");
		
		Возврат ТаблицаКлючей[0].КлючСтроки + 1;
	КонецЕсли;		
КонецФункции

&НаКлиенте
Процедура ТаблицаДокументовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	СтрокаТабличнойЧасти = Элементы.ТаблицаДокументов.ТекущиеДанные;
	СтрокаТабличнойЧастиРеквизиты = Элементы.ТаблицаРеквизиты.ТекущиеДанные;
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧасти.КлючСтроки = ПолучитьКлючСтроки();
		ЗаполнитьТаблицу(СтрокаТабличнойЧасти.КлючСтроки);
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки);
		Элементы.ТаблицаРеквизиты.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполнитьСписокВыбораДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ЗаполнитьСписокВыбораДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	СтрокаТабличнойЧасти = Элементы.ТаблицаРеквизиты.ТекущиеДанные;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки);
	СтрокиДок = Объект.ТаблицаДокументов.НайтиСтроки(Отбор);
	Если НЕ СтрокиДок.Количество() = 0 Тогда
		СтрДок = СтрокиДок.Получить(0);
		СтрРеквизиты = Объект.ТаблицаРеквизиты.НайтиПоИдентификатору(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
		// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
        //СохранитьНаСервере(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрДок.ВидДокумента, СтрДок.ВидДокументаЗалогодателя);
	    СохранитьНаСервере(СтрокаТабличнойЧасти.ПолучитьИдентификатор(), СтрДок.ВидДокумента, СтрДок.ВидДокументаЗалогодателя, СтрДок.ВидГражданства);
		// -- Сербаев 05.06.2023
	КонецЕсли;	
КонецПроцедуры

&НаСервере
// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
//Процедура ОчиститьРегистрНаСервере(ВидДокумента, ВидДокументаЗалогодателя)
Процедура ОчиститьРегистрНаСервере(ВидДокумента, ВидДокументаЗалогодателя, ВидГражданства)
// -- Сербаев 05.06.2023		
	НаборЗаписей = РегистрыСведений.ЛБ_НастройкаРеквизитовДокументовЗалогодателя.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента);
    НаборЗаписей.Отбор.ВидДокументаЗалогодателя.Установить(ВидДокументаЗалогодателя);
	// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
	НаборЗаписей.Отбор.ВидДокумента.Установить(ВидГражданства);
    // -- Сербаев 05.06.2023

    НаборЗаписей.Записать(); 
КонецПроцедуры	

&НаКлиенте
Процедура ТаблицаДокументовПередУдалением(Элемент, Отказ)
	СтрокаТабличнойЧасти = Элементы.ТаблицаДокументов.ТекущиеДанные;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧасти.КлючСтроки);
    Строки = Объект.ТаблицаРеквизиты.НайтиСтроки(Отбор);
	
	Для каждого Стр Из Строки Цикл
		Объект.ТаблицаРеквизиты.Удалить(Стр);
	КонецЦикла;	
	
	// ++ Сербаев 05.06.2023 (Добавление "Вида гражданства" в натройку реквизитов документов клиента)
    //ОчиститьРегистрНаСервере(СтрокаТабличнойЧасти.ВидДокумента, СтрокаТабличнойЧасти.ВидДокументаЗалогодателя);
	ОчиститьРегистрНаСервере(СтрокаТабличнойЧасти.ВидДокумента, СтрокаТабличнойЧасти.ВидДокументаЗалогодателя, СтрокаТабличнойЧасти.ВидГражданства);
	// -- Сербаев 05.06.2023
КонецПроцедуры
